{"keras_version": "1.2.1", "config": {"output_layers": [["predictions", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 40, 160, 3], "input_dtype": "float32", "sparse": false}}, {"name": "block1_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"name": "block1_conv1", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 64, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block1_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"name": "block1_conv2", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 64, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"name": "block1_pool", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"name": "block2_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"name": "block2_conv1", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block2_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"name": "block2_conv2", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 128, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"name": "block2_pool", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"name": "block3_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"name": "block3_conv1", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 256, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block3_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"name": "block3_conv2", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 256, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block3_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"name": "block3_conv3", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 256, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"name": "block3_pool", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"name": "block4_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"name": "block4_conv1", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block4_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"name": "block4_conv2", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block4_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"name": "block4_conv3", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"name": "block4_pool", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"name": "block5_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"name": "block5_conv1", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block5_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"name": "block5_conv2", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block5_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"name": "block5_conv3", "activation": "relu", "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "nb_filter": 512, "b_constraint": null, "trainable": true, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"name": "block5_pool", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"name": "fc", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"name": "fc", "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "input_dim": 2560, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1024}}, {"name": "fc2", "class_name": "Dense", "inbound_nodes": [[["fc", 0, 0]]], "config": {"name": "fc2", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "input_dim": 1024, "activity_regularizer": null, "W_regularizer": null, "output_dim": 2}}, {"name": "predictions", "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0]]], "config": {"name": "predictions", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "input_dim": 2, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1}}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}