{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "nb_filter": 24}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "nb_filter": 36}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "nb_filter": 48}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "bias": true, "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "b_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "nb_filter": 48}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "bias": true, "W_constraint": null, "input_dim": 48, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "bias": true, "W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "output_dim": 50, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "bias": true, "W_constraint": null, "input_dim": 50, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "bias": true, "W_constraint": null, "input_dim": 10, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "trainable": true, "output_dim": 1, "activity_regularizer": null}}]}